In [1]:
import pandas as pd
import numpy as np

## CREATING PANDAS SERIES

In [2]:
data = np.array(['a', 'b', 'c', 'd'])
s = pd.Series(data)

In [3]:
s

0    a
1    b
2    c
3    d
dtype: object

## SETTING INDEX IN PANDA SERIES

In [4]:
s1 = pd.Series(data,index=[100,101,102,103])
s1

100    a
101    b
102    c
103    d
dtype: object

## PASSING DICTIONARY TO PANDA SERIES

In [5]:
data1 = {'a':0,'b':1,'c':2,'d':3}
s2 = pd.Series(data1)

In [6]:
s2

a    0
b    1
c    2
d    3
dtype: int64

When only data in dictionary format to panda Series then the keys of dictionary are taken as the index of the formed panda series.

In [7]:
s3 = pd.Series(data1,index=['b','c','d','a'])
s3

b    1
c    2
d    3
a    0
dtype: int64

If index is passed then values corresponding to labels in ndex will be pulled out as illustrated in above example.

## ACCESSING DATA FROM SERIES WITH POSITION

In [8]:
s3

b    1
c    2
d    3
a    0
dtype: int64

In [9]:
s3[0]

# It will return the first element of panda series

1

In [10]:
s3[-1]

#It will retrieve the last element of the series.

0

In [11]:
s3[1:-1]

#It will retrieve data starting from index 1 till last element 
# where last element is not included.

c    2
d    3
dtype: int64

## ACCESSING DATA USING LABEL as INDEX

In [12]:
s2

a    0
b    1
c    2
d    3
dtype: int64

In [13]:
s2['a']

#Will retieve value corresponding to index 'a' as specified.

0

In [14]:
s2[['a','c','d']]

#Accessing multiple index from dataframe using labelling.

a    0
c    2
d    3
dtype: int64

In [15]:
s2['e']

#Error raised as there is no index as e.

KeyError: 'e'

## CREATING PANDAS DATAFRAME

#### 1. Creating Empty Dataframe

In [16]:
df = pd.DataFrame()

In [17]:
df

Empty DataFrame
Columns: []
Index: []

#### 2. Creating a dataframe from lists

In [18]:
df1 = pd.DataFrame([1,2,3,4,5])

In [19]:
df1

   0
0  1
1  2
2  3
3  4
4  5

In [20]:
data2 = [['Alexa',16],['Bobby',14]]

In [21]:
df2 = pd.DataFrame(data2,columns=['Name','Age'])
df2

    Name  Age
0  Alexa   16
1  Bobby   14

Here a list is being passed to dataframe and columns of the dataframe formed are to named as 'Name' and 'Age' instead of default values 0 and 1 respectively.

#### 3. Creating Dataframe from Dictionary of Lists

In [22]:
data3 = {'Name':['Tom','Jerry'],'Age':[28,26]}
df3 = pd.DataFrame(data3)

In [23]:
df3

    Name  Age
0    Tom   28
1  Jerry   26

Here the keys of dictionary data3 represents column name of dataframe and values of each key denotes rows.

#### 4. Creating Indexed Dataframes

In [24]:
df4 = pd.DataFrame(data3,index=['rank1','rank2'])
df4

        Name  Age
rank1    Tom   28
rank2  Jerry   26

Here, on passing dictionary to dataframe the index values corresponding to each row is also passed.

#### 5. Creating a Dataframe from List of Dictionaries

In [25]:
data4 = [{'a':1,'b':2},{'a':10,'b':20,'c':30}]
df5 = pd.DataFrame(data4,index=['First','Second'])
df5

         a   b     c
First    1   2   NaN
Second  10  20  30.0

#### 6. Creating a Dataframe from Dictionary of Series

In [26]:
data5 = {'one':pd.Series([1,2,3],index=['a','b','c']),
        'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}

In [27]:
df6 = pd.DataFrame(data5)
df6

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

Here, a dictionary is being created with keys as 'one' and 'two' which serves as column for the dataframe.

The values of keys in data5 is the rows values and index denotes the index of the dataframe.
Hence, for 'one' as key the values are 1,2,3 and indices are 'a','b' and 'c' whereas for 'two' as key the values are 1,2,3,4 and indices are 'a','b','c' and 'd'.

Since, there is no indice 'd' in 'one' column.Hence, it is to be filled with NaN(Not a number).

## COLUMN SELECTION

In [28]:
df6

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [29]:
df6['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

Here, the column 'one' is selected from dataframe df6.

## COLUMN ADDITION

#### 1. Adding a new column

In [30]:
df3

    Name  Age
0    Tom   28
1  Jerry   26

In [31]:
df3['Rank'] = pd.Series([1,3],index=[0,1])

In [32]:
df3

    Name  Age  Rank
0    Tom   28     1
1  Jerry   26     3

#### 2. Adding a new column using existing columns of dataframe

In [33]:
df5

         a   b     c
First    1   2   NaN
Second  10  20  30.0

In [34]:
df5['d'] = df5['a'] + df5['c']

In [35]:
df5

         a   b     c     d
First    1   2   NaN   NaN
Second  10  20  30.0  40.0

Here, the contents of column 'a' and column 'c' are being added into column 'd'.

If any column contain value NaN then the end result is also NaN.

## COLUMN DELETION

In [36]:
df5

         a   b     c     d
First    1   2   NaN   NaN
Second  10  20  30.0  40.0

In [37]:
del df5['c']

# Using del method

In [38]:
df5

         a   b     d
First    1   2   NaN
Second  10  20  40.0

In [39]:
df5.pop('d')

#Using pop method

First      NaN
Second    40.0
Name: d, dtype: float64

In [40]:
df5

         a   b
First    1   2
Second  10  20

## ROW SELECTION

#### 1. Using loc method

In [41]:
df1

   0
0  1
1  2
2  3
3  4
4  5

In [42]:
df1.loc[0]

0    1
Name: 0, dtype: int64

In [43]:
df6

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [44]:
df6.loc[['a','b']]

   one  two
a  1.0    1
b  2.0    2

Selecting multiple rows using loc method by passing indexes to be selected as a list

#### 2. Using iloc method

In [45]:
df1

   0
0  1
1  2
2  3
3  4
4  5

In [46]:
df1.iloc[2]

#Here, the data corresponding to index 2 or row 3 is being selected.

0    3
Name: 2, dtype: int64

In [47]:
df6

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [48]:
df6.iloc[2]

one    3.0
two    3.0
Name: c, dtype: float64

## SLICING ROWS

In [49]:
df6

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [50]:
df6[1:-1]

   one  two
b  2.0    2
c  3.0    3

It shows data from index 1 upto last index of rows(last is not included)

## ADDITION OF ROWS

In [51]:
df7  = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df8  = pd.DataFrame([[10,20],[30,40]],columns=['a','b'])

In [52]:
df7 = df7.append(df8)
df7

    a   b
0   1   2
1   3   4
0  10  20
1  30  40

## DELETION  OF ROWS

In [53]:
df7

    a   b
0   1   2
1   3   4
0  10  20
1  30  40

In [54]:
df7.drop(1)

#Drop rows with label 1(drop all rows if label is repeated)

    a   b
0   1   2
0  10  20

## STATISTICAL FUNCTIONS IN PANDAS

In [55]:
df5

         a   b
First    1   2
Second  10  20

#### 1. Mean

In [56]:
df5.mean()

a     5.5
b    11.0
dtype: float64

The mean for column 'a' is 1+10/2 = 5.5 and for column 'b' is 11

#### 2. Median

In [57]:
df5.median()

a     5.5
b    11.0
dtype: float64

#### 3. Standard Deviation

In [58]:
df5.std()

a     6.363961
b    12.727922
dtype: float64

#### 4. Variance

In [59]:
df5.var()

a     40.5
b    162.0
dtype: float64

#### 5. Correlation

In [60]:
df5.corr()

     a    b
a  1.0  1.0
b  1.0  1.0

#### 6. Max value

In [61]:
df5.max()

a    10
b    20
dtype: int64

#### 7. Min value

In [62]:
df5.min()

a    1
b    2
dtype: int64

#### 8. Sum

In [63]:
df5.sum()

a    11
b    22
dtype: int64

## MERGING PANDA DATAFRAMES

In [64]:
df9 = pd.DataFrame({ 'id':[1,2,3,4,5], 
                    'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
                    'subject_id':['sub1','sub2','sub4','sub6','sub5']}) 
df10 = pd.DataFrame({ 'id':[1,2,3,4,5], 
                     'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
                     'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [65]:
df9

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [66]:
df10

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

#### 1. Left Join

In [67]:
pd.merge(df9,df10,on='subject_id',how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

#### 2. Right Join

In [68]:
pd.merge(df9,df10,on='subject_id',how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

#### 3. Inner join

In [69]:
pd.merge(df9,df10,on='subject_id',how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

#### 4. Outer Join

In [70]:
pd.merge(df9,df10,on='subject_id',how='outer')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

## MISCELLANEOUS FUNCTIONS IN PANDAS

### 1. Group By

In [71]:
ipl_data = {'Team': ['Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
            'Rank': [1,1,2,4,1,2], 
            'Year': [2016,2017,2016,2014,2015,2017],
            'Points':[756,788,694,701,804,690]}

In [72]:
df11 = pd.DataFrame(ipl_data)
df11

     Team  Rank  Year  Points
0   Kings     1  2016     756
1   Kings     1  2017     788
2  Riders     2  2016     694
3  Royals     4  2014     701
4  Royals     1  2015     804
5  Riders     2  2017     690

In [73]:
df11.groupby('Team').sum()

        Rank  Year  Points
Team
Kings      2  4033    1544
Riders     4  4033    1384
Royals     5  4029    1505

### 2. Concatenation

In [74]:
df12 = pd.DataFrame([1,2,3,4,5])
df13 = pd.DataFrame([1,8,27,64,125])

In [75]:
pd.concat([df12,df13])

#Appending as new rows

     0
0    1
1    2
2    3
3    4
4    5
0    1
1    8
2   27
3   64
4  125

In [76]:
pd.concat([df12,df13],axis=1)

#Appending as new column

   0    0
0  1    1
1  2    8
2  3   27
3  4   64
4  5  125

### 3. Checking Nulls

In [77]:
df14 = pd.DataFrame([1,2,3,np.nan,5,6,np.nan,7,np.nan])

In [78]:
df14

     0
0  1.0
1  2.0
2  3.0
3  NaN
4  5.0
5  6.0
6  NaN
7  7.0
8  NaN

In [79]:
df14.isnull().sum()

0    3
dtype: int64

Hence, there are 3 nulls in column 0 of dataframe df14.

## IMPORTING CSV FILES

In [80]:
df15 = pd.read_csv('panda_example.csv')

In [81]:
df15

   Roll no      Name  Marks
0     1001     Alexa     56
1     1002       Bob     53
2     1003      John     87
3     1004    Rafael     46
4     1005      Lucy     24
5     1006    Markov     89
6     1007   Venissa     90
7     1008  Meronica     86

In [82]:
# Setting index after dataframe have been created.
df15 = df15.set_index('Roll no')

In [83]:
df15

             Name  Marks
Roll no
1001        Alexa     56
1002          Bob     53
1003         John     87
1004       Rafael     46
1005         Lucy     24
1006       Markov     89
1007      Venissa     90
1008     Meronica     86

In [84]:
# Viewing only above 5 entries of dataframe
df15.head()

           Name  Marks
Roll no
1001      Alexa     56
1002        Bob     53
1003       John     87
1004     Rafael     46
1005       Lucy     24